/* ======================================== */
/*    程式实例: 6_2_2.c                      */
/*    使用列印数组函数来说明递归调用             */
/* ======================================== */
#include <stdio.h>

int list[6] = {1, 2, 3, 4, 5, 6};

/* ---------------------------------------- */
/*  递归数组反向列印函数                       */
/* ---------------------------------------- */
void invert_array(int j) {
    if (j < 6) {
        /* 递归链表列印函数调用 */
        invert_array(j + 1);
        printf("[%d]", list[j]);
    }
    // else /* 隐含终止条件 */
}

/* ---------------------------------------- */
/*  主程式: 反向列印数组内容.                   */
/* ---------------------------------------- */
int main(int argc, char *argv[]) {
    int i;

    printf("数组的内容:\n");
    for (i = 0; i < 6; i++) printf("[%d]", list[i]);
    printf("\n");
    printf("递归列印数组的内容:\n");
    invert_array(0);
    printf("\n");

    return 0;
}
